ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad7156_lt/low_touch_task.c
/**
***************************************************************************
* @addtogroup Tasks
* @{
* @file         <low_touch_task.c>
* @author       ADI
* @version      V1.0.0
* @date         17-Nov-2020
* @brief        Source file contains functions low touch application
***************************************************************************
* @attention
***************************************************************************
*/
/*!
*  \copyright Analog Devices
* ****************************************************************************
*
* License Agreement
*
* Copyright (c) 2020 Analog Devices Inc.
* All rights reserved.
*
* This source code is intended for the recipient only under the guidelines of
* the non-disclosure agreement with Analog Devices Inc.
*

* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
* EXPRESS OR  IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
* IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
* CLAIM, DAMAGES OR OTHER  LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
* TORT OR OTHERWISE, ARISING  FROM, OUT OF OR IN CONNECTION WITH THE
* SOFTWARE OR THE USE OR OTHER  DEALINGS IN THE SOFTWARE.
* ****************************************************************************
*/

/*---------------------------- Includes --------------------------------------*/
#ifdef LOW_TOUCH_FEATURE
#include "low_touch_task.h"
#include "Common.h"
#include "ad7156.h"
#include "app_timer.h"
#include "hw_if_config.h"
#include "m2m2_core.h"
#include "nrf_drv_gpiote.h"
#include "nrf_log_ctrl.h"
#include "post_office.h"
#include "touch_detect.h"
#include <adi_osal.h>
#include <app_cfg.h>
#include <common_application_interface.h>
#include <low_touch_application_interface.h>
#include <math.h>
#include <post_office.h>
#include <stdio.h>
#include <stdlib.h>
#include <task_includes.h>
#ifdef VSM_MBOARD
#include "watch_vsm_motherboard_pin_config.h"
#elif PCBA
#include "watch_board_pcba_pin_config.h"
#else
#include "watch_board_evt_pin_config.h"
#endif
#ifdef DCB
#include "adi_dcb_config.h"
#include "dcb_general_block.h"
#include "wrist_detect_block.h"
#include <dcb_interface.h>
#endif
/* Low touch App Module Log settings */
#define NRF_LOG_MODULE_NAME LT_App

#if LT_APP_CONFIG_LOG_ENABLED
#ifdef NRF_LOG_DEFAULT_LEVEL
#undef NRF_LOG_DEFAULT_LEVEL
#define NRF_LOG_DEFAULT_LEVEL LT_APP_CONFIG_LOG_LEVEL
#endif
#define NRF_LOG_INFO_COLOR LT_APP_CONFIG_INFO_COLOR
#define NRF_LOG_DEBUG_COLOR LT_APP_CONFIG_DEBUG_COLOR
#else // LT_APP_CONFIG_LOG_ENABLED
#define NRF_LOG_LEVEL 0
#endif // LT_APP_CONFIG_LOG_ENABLED

#include "nrf_log.h"
NRF_LOG_MODULE_REGISTER();

/* For low touch FreeRTOS Task Creation */
ADI_OSAL_STATIC_THREAD_ATTR g_lt_task_attributes;
uint8_t ga_lt_task_stack[APP_OS_CFG_LT_APP_TASK_STK_SIZE];
StaticTask_t g_lt_task_tcb;
ADI_OSAL_THREAD_HANDLE gh_lt_task_handler;
ADI_OSAL_QUEUE_HANDLE gh_lt_task_msg_queue = NULL;
// Create semaphores
//static ADI_OSAL_SEM_HANDLE   lt_task_evt_sem;

/* ON wrist time detection for starting logging 5000 (ms). */
#define LT_ON_WRIST_TIME_INTERVAL 5000
/* OFF wrist time detection for starting logging 3000 (ms). */
#define LT_OFF_WRIST_TIME_INTERVAL 3000
/* Air Capacitance Value (uF) kept at default
* This was kept to the min. value seen in 10 trials
*/
#define LT_AIR_CAP_VAL 1380
/* Skin Capacitance Value (uF) kept at default
* This was kept to the max. value seen in 10 trials
*/
#define LT_SKIN_CAP_VAL 1340
/* Handler for repeated timer for LT ON. */
APP_TIMER_DEF(m_lt_on_timer_id);
/* Handler for repeated timer for LT OFF. */
APP_TIMER_DEF(m_lt_off_timer_id);

#ifdef DVT
/* For Watch prototype:
 * A maximum OffWrist Capacitance value in uF put, based on
 * seeing from couple of Watches, used for reset condition */
#define TOUCH_DETECTION_THRESHOLD 1490
//#define TOUCH_DETECTION_THRESHOLD     1300 //Bare board
#else
#define TOUCH_DETECTION_THRESHOLD 1300
#endif

/*Timeout value to extract msg from PO Msg Queue is to be:
 ADI_OSAL_TIMEOUT_FOREVER -> m2m2 pkts
 ADI_OSAL_TIMEOUT_NONE    -> for processing LT event */
static volatile uint32_t  g_lt_task_timeout = ADI_OSAL_TIMEOUT_FOREVER;

/* Flag which is used to enable/disable LT application; which is later used to
 * prevent mulitple init-deinit from happening */
static uint8_t gEnableLowTouchDetection = 0;

/* Debug flag to count the events happening */
uint8_t OnWristEventDetecedCnt = 0, OffWristEventDetecedCnt = 0;
/* Flag which gets set, when either ON/OFF timer expires. Its based on this flag
 * and the event detected, that the LT commands are send */
volatile uint8_t gLowTouchTimerUp = 0;

/* Flag which gets set in the AD7156 interrupt handler & cleared upon servicing
 * the event */
volatile uint8_t gsLowTouchAd7156IntFlag = 0;
/* Variable which holds the gpio output value, when the AD7156 interrupt handler
 * gets called */
volatile uint8_t gsLowTouchAd7156IntValue = 0;
/* Variable which holds the capacitance value, when the AD7156 interrupt handler
 * gets called */
volatile uint16_t gsLowTouchAd7156CapVal = 0;
/* Variable which holds the status of ad7156 CH2 specific init/deinitialisation */
static uint8_t gsLowTouchInitFlag = 0;
/* Variable to hold the last ON Wrist cap value based on which, later events cap
 * is taken, to consider for current Wrist state*/
volatile uint16_t g_onWrCapValue = TOUCH_DETECTION_THRESHOLD;
/* Variable to hold the last OFF Wrist cap value based on which, later events
 * cap is taken, to consider for current Wrist state*/
volatile uint16_t g_offWrCapValue = TOUCH_DETECTION_THRESHOLD;
/* Debug Variable which counts the no: AD7156 interrupts received */
volatile uint16_t gsLowTouchAd7156IntCount = 0;
/* Variable which holds sensitivity to be configured to AD7156 Ch2 Cap sensor
 After configuring AD7156 sensitivity, this variable is updated and used as
 an offset for comparison of cap values b/w On and Off wrist events */
uint16_t gn_ch2_sensitivity;

static int16_t user_applied_onWristTimeThreshold = 0;
static int16_t user_applied_offWristTimeThreshold = 0;
static int16_t user_applied_airCapVal = 0;
static int16_t user_applied_skinCapVal = 0;

