ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad7156_lt/low_touch_task.c
    switch (p_in_payload->command) {
    case M2M2_APP_COMMON_CMD_READ_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (lt_app_read_lcfg(p_in_payload->ops[i].field, &reg_data) == LT_APP_SUCCESS) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = reg_data;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_READ_LCFG_RESP;
      break;
    case M2M2_APP_COMMON_CMD_WRITE_LCFG_REQ:
      for (int i = 0; i < p_in_payload->num_ops; i++) {
        if (lt_app_write_lcfg(p_in_payload->ops[i].field,
                p_in_payload->ops[i].value) == LT_APP_SUCCESS) {
          status = M2M2_APP_COMMON_STATUS_OK;
        } else {
          status = M2M2_APP_COMMON_STATUS_ERROR;
        }
        p_resp_payload->ops[i].field = p_in_payload->ops[i].field;
        p_resp_payload->ops[i].value = p_in_payload->ops[i].value;
      }
      p_resp_payload->command =
          (M2M2_APP_COMMON_CMD_ENUM_t)M2M2_APP_COMMON_CMD_WRITE_LCFG_RESP;
      break;
    default:
      /* Something has gone horribly wrong. */
      return NULL;
    }
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_payload->num_ops = p_in_payload->num_ops;
    p_resp_payload->status = status;
  }
  return p_resp_pkt;
}

/*!
 ****************************************************************************
 *@brief      LT app lcfg Read/write configuration options
 *@param      pPkt: pointer to the packet structure
 *@return     m2m2_hdr_t
 ******************************************************************************/
static m2m2_hdr_t *lt_app_read_ch2_cap(m2m2_hdr_t *p_pkt) {
  M2M2_APP_COMMON_STATUS_ENUM_t status = M2M2_APP_COMMON_STATUS_ERROR;
  /* Allocate a response packet with space for the correct number of operations
   */
  PKT_MALLOC(p_resp_pkt, lt_app_rd_ch2_cap, 0);
  if (NULL != p_resp_pkt) {
    PYLD_CST(p_resp_pkt, lt_app_rd_ch2_cap, p_resp_payload);
    uint16_t capVal = 0;

    //if(gsLowTouchInitFlag)
    //{
      capVal = AD7156_ReadChannelCap(2); // unit in uF
      status = M2M2_APP_COMMON_STATUS_OK;
    //} else {
    //  status = M2M2_APP_COMMON_STATUS_ERROR;
    //}

    p_resp_payload->command = M2M2_LT_COMMAND_RD_CH2_CAP_RESP;
    p_resp_payload->status = status;
    p_resp_payload->capVal = capVal;
    p_resp_pkt->dest = p_pkt->src;
    p_resp_pkt->src = p_pkt->dest;
  }
  return p_resp_pkt;
}

#ifdef ENABLE_LT_TEST_PAGE
/* Variable which holds the status of LT logging in progress or not */
extern uint8_t gLowTouchRunning;
/**
 * @brief Funtion to take LT specific variables, to be shown from LT test page
 *
 * @details This function fills the string input arguments, with LT status
 * variables, to be displayed from LT test page
 *
 * @param str0, str1, str2 - string input arguments, to which LT status gets
 * copied to
 * @retval   None
 */
void lt_disp_str(char *str0, char *str1, char *str2) {
  sprintf(str0, "OnC:%04d OffC:%04d", g_onWrCapValue, g_offWrCapValue);
  sprintf(str1, "Int:%d Val:%d Cap:%04d", gsLowTouchAd7156IntCount,
      gsLowTouchAd7156IntValue, gsLowTouchAd7156CapVal);
  (eCurDetection_State == OFF_WRIST)
      ? sprintf(str2, "OFF_WR %d", gLowTouchRunning)
      : sprintf(str2, "ON_WR %d", gLowTouchRunning);
}
#endif

/** @brief    Low Touch Enable Function
 * @details  Sets/Resets the Low touch enable flag; which activates/deactivates
 * the touch sensor and touch detection mechanism
 * @param    True --> Sets the flag
 *           False --> Resets the flag
 * @retval   None
 */
int EnableLowTouchDetection(bool bFlag) {
  uint32_t ret;
  gEnableLowTouchDetection = bFlag;
  if (bFlag) {
    NRF_LOG_INFO("Enabling LT app");
    ret = low_touch_init();
  } else {
    NRF_LOG_INFO("Disabling LT app");
    ret = low_touch_deinit();
  }
  return ret;
}

/** @brief   Low Touch Application Initialization status
 * @details  Check if LT application is enabled or disabled
 * @param    None
 * @retval   0  --> LT app not enabled 1 --> LT app already enabled
 */
int get_lt_app_status() {
  return gsLowTouchInitFlag;
}

/** @brief   Low Touch Initialization
 * @details  Register handle for low touch application from AD7156 for wrist
 * Touch detection
 * @param    None
 * @retval   0  --> success 1 --> fail(returned when it has been initialised already)
 */
int low_touch_init() {
  uint16_t capVal;
  if (!gsLowTouchInitFlag) {
    init_lt_app_lcfg();
    Register_out2_pin_detect_func(out2_pin_detect);
    bottom_touch_func_set(1);
    gsLowTouchInitFlag = 1;

    //Detect initial Wrist status
    capVal = AD7156_ReadChannelCap(2); // unit in uF
    /*Its seen that an offset of 10 could come in the capVal read*/
    if((capVal-10) <= lt_app_cfg.skinCapVal)
    {
      NRF_LOG_INFO("Init:Resetting timer, ON wrist detected.");
      LowTouchResetTimer();
      eDetection_State = ON_WRIST; /*watch is on wrist interrupt detected*/
      NRF_LOG_INFO("ON wrist detected. cap2=%d", capVal);
      g_onWrCapValue = capVal;
    }
    else if(capVal > lt_app_cfg.skinCapVal &&  capVal <= lt_app_cfg.airCapVal)
    {
      NRF_LOG_INFO("Init: OFF wrist detected.");
      eDetection_State = OFF_WRIST; /*watch is off wrist interrupt detected*/
      NRF_LOG_INFO("OFF wrist detected. cap2=%d", capVal);
      g_offWrCapValue = capVal;
    }
    else
      eDetection_State = OFF_WRIST; /*watch is off wrist interrupt detected*/
    return 0;
  }
  return 1;
}

/** @brief    Low Touch Deinitialization
 * @details  Unregister handle for low touch application from AD7156 for wrist
 * Touch detection; stop app timers
 * @param    None
 * @retval   0  --> success 1 --> fail(returned when it has been de-initialised already)
 */
int low_touch_deinit() {
  if (gsLowTouchInitFlag) {
    bottom_touch_func_set(0);
    Unregister_out2_pin_detect_func(out2_pin_detect);
    gsLowTouchAd7156IntFlag = 0;
    gsLowTouchAd7156IntCount = 0;
    gsLowTouchAd7156IntValue = 0;
    gsLowTouchAd7156CapVal = 0;
    g_onWrCapValue = TOUCH_DETECTION_THRESHOLD;
    g_offWrCapValue = TOUCH_DETECTION_THRESHOLD;
    lt_on_timer_stop();
    lt_off_timer_stop();
    gLowTouchTimerUp = 0;
    eDetection_State = OFF_WRIST, eCurDetection_State = OFF_WRIST;
    /*stop low touch logging*/
    SendStopLowTouchLogReq();
    gsLowTouchInitFlag = 0;

