ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad7156_lt/low_touch_task.c
    return 0;
  }
  return 1;
}

/** @brief    Reset the LT ON/OFF timers
 * @param    None
 * @retval   None
 */
static void LowTouchResetTimer() {
  lt_on_timer_stop();
  lt_on_timer_start();
  lt_off_timer_stop();
  lt_off_timer_start();
  gLowTouchTimerUp = 0;
}

/** @brief   LT Timer event function, which is executed from the LT task.
 * @details  LT ON/OFF wrist detection timer expiry is handled.
 *           Based on detected state, LT start / stop commands are sent.
 * @param    None
 * @retval   0 --> success
 */
int LowTouchTimerEvent() {
  if (gEnableLowTouchDetection) {
    if (gLowTouchTimerUp) {
      /*Timer is up; check the new detected state*/
      gLowTouchTimerUp = 0;

#ifndef DVT
      if (!gsLowTouchAd7156IntValue) // value=0 implies ON or touch
      {
#endif
        if (eDetection_State == ON_WRIST) {
          /*watch on wrist event deteced*/
          if (eCurDetection_State != eDetection_State) {
            OnWristEventDetecedCnt++;
            SendStartLowTouchLogReq(); /*start low touch logging*/
            NRF_LOG_INFO("send start low touch log req");
            eCurDetection_State =
                eDetection_State; /*Update the current detected state*/
          }
        }
        // eDetection_State = ON_WRIST;
#ifndef DVT
      } else {
#endif
        if (eDetection_State == OFF_WRIST) {
          /*watch off wrist event deteced*/
          if (eCurDetection_State != eDetection_State) {
            OffWristEventDetecedCnt++;
            SendStopLowTouchLogReq(); /*stop low touch logging*/
            NRF_LOG_INFO("send stop low touch log req");
            eCurDetection_State =
                eDetection_State; /*Update the current detected state*/
          }
        }
        // eDetection_State = OFF_WRIST;
#ifndef DVT
      }
#endif
    } // if(gLowTouchTimerUp)
  }   // if (gEnableLowTouchDetection)
  return 0;
}

/** @brief    LT event function, which is executed from the LT task.
 * @details  Wrist ON/OFF Detection state machine logic gets executed here.
 *           Also LT ON/OFF detection timer expiry handling
 *           AD7156 configuration for LT application:
 *           -----------------------------------------
 *           Adaptive Threshold,In-Window Threshold Mode,with sensitivity of
 * 25uF Output2 from channel2, becomes Active(value:1) when,
 * Data > Avg - Sensitivity
 * Data < Avg + Sensitivity
 * ON_WRIST/OFF_WRIST is detected based on the state machine vairable
 * eDetection_State and comparison of g_onWrCapValue with gsLowTouchAd7156CapVal;
 * g_offWrCapValue is maintained for debugging purpose only
 *
 *           -----------------------------------------
 * @param    None
 * @retval   0 --> success
 */
int LowTouchSensorEvent() {
  if (gEnableLowTouchDetection) {
    if (gsLowTouchAd7156IntFlag) {
      /*AD7156 triggered an interrupt*/
      gsLowTouchAd7156IntFlag = 0;
      gsLowTouchAd7156CapVal = AD7156_ReadChannelCap(2); // unit in uF
#ifndef DVT
      if (!gsLowTouchAd7156IntValue) // value=0 implies ON or touch
      {
#endif
#ifdef DVT
        /* Check if curr Cap value detected is less than or equal to last ONWr
           Cap value, and that the last Detection state was OFFWrist*/
        if (gsLowTouchAd7156CapVal-(gn_ch2_sensitivity/2) <= g_onWrCapValue &&
        //if (gsLowTouchAd7156CapVal-10 <= g_onWrCapValue &&
            (eDetection_State != ON_WRIST))
#else
      if (gsLowTouchAd7156CapVal > TOUCH_DETECTION_THRESHOLD)
#endif
        {
          g_onWrCapValue = gsLowTouchAd7156CapVal;
          /*start the timer to see if the detected state is consistent for 5
           * more seconds*/
          NRF_LOG_INFO("Resetting timer, ON wrist detected.");
          LowTouchResetTimer();
          eDetection_State = ON_WRIST; /*watch is on wrist interrupt detected*/
          NRF_LOG_INFO("ON wrist detected. cap2=%d", gsLowTouchAd7156CapVal);
          return 0;
        }
#ifndef DVT
      } else {
#endif
#ifdef DVT
        /* Check if curr Cap value detected is greater than last ONWr Cap value
         * and that the last Detection state was ONWrist*/
        if (gsLowTouchAd7156CapVal > g_onWrCapValue &&
            (eDetection_State != OFF_WRIST))
#else
      if (gsLowTouchAd7156CapVal < TOUCH_DETECTION_THRESHOLD)
#endif
        {
          g_offWrCapValue = gsLowTouchAd7156CapVal;
          gn_ch2_sensitivity = g_offWrCapValue - g_onWrCapValue;
          /*start the timer to see if the detected state is consistent for 3
           * more seconds*/
          NRF_LOG_INFO("Resetting timer, OFF wrist detected.");
          LowTouchResetTimer();
          eDetection_State =
              OFF_WRIST; /*watch is off wrist interrupt detected*/
          NRF_LOG_INFO("OFF wrist detected. cap2=%d", gsLowTouchAd7156CapVal);
          return 0;
        }

        /* To adjust for Capcitance changes and interrupt triggers detected
         within OFF_WRIST conditions */
        if (gsLowTouchAd7156CapVal > g_onWrCapValue &&
            (eDetection_State == OFF_WRIST)) {
          g_offWrCapValue = gsLowTouchAd7156CapVal;
          return 0;
        }
#ifndef DVT
      }
#endif
    } // if(gsLowTouchAd7156IntFlag)
  }   // if (gEnableLowTouchDetection)
  return 0;
}

/**
 * @brief  Sends Low touch log start request to the system task
 * @param  None
 * @return None
 */
static void SendStartLowTouchLogReq() {
  m2m2_hdr_t *response_mail = NULL;
  ADI_OSAL_STATUS err;

  response_mail =
      post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));

  if (response_mail != NULL) {
    _m2m2_app_common_cmd_t *start_low_touch_log_req =
        (_m2m2_app_common_cmd_t *)&response_mail->data[0];

    /* send request packet */
    response_mail->src = M2M2_ADDR_UNDEFINED;
    response_mail->dest = M2M2_ADDR_SYS_PM;
    response_mail->checksum = 0x0000;

    start_low_touch_log_req->command =
        M2M2_PM_SYS_COMMAND_ENABLE_USER_CONFIG_LOG_REQ;
    start_low_touch_log_req->status = M2M2_APP_COMMON_STATUS_OK;
    post_office_send(response_mail, &err);
  }
}

/**
 * @brief  Sends Low touch log stop request to the system task
 * @param  None
 * @return None
 */
static void SendStopLowTouchLogReq() {
  m2m2_hdr_t *response_mail = NULL;
  ADI_OSAL_STATUS err;

  response_mail =
      post_office_create_msg(M2M2_HEADER_SZ + sizeof(_m2m2_app_common_cmd_t));

  if (response_mail != NULL) {
    _m2m2_app_common_cmd_t *stop_low_touch_log_req =
        (_m2m2_app_common_cmd_t *)&response_mail->data[0];

    /* send request packet */
    response_mail->src = M2M2_ADDR_UNDEFINED;
    response_mail->dest = M2M2_ADDR_SYS_PM;
    response_mail->checksum = 0x0000;

