ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad7156_lt/low_touch_task.c
    stop_low_touch_log_req->command =
        M2M2_PM_SYS_COMMAND_DISABLE_USER_CONFIG_LOG_REQ;
    stop_low_touch_log_req->status = M2M2_APP_COMMON_STATUS_OK;
    post_office_send(response_mail, &err);
  }
}

/**
 * @brief  Callback for Ad7156 Interrupt
 * @param  value - gpio value at the time interrupt handler was called
 * @return none
 */
static void LowTouchAd7156IntCallback(uint8_t value) {
  gsLowTouchAd7156IntFlag = 1;
  gsLowTouchAd7156IntCount++;
  /* either 1 or 0 ie Touch or No Touch */
  gsLowTouchAd7156IntValue = value;
}

/**@brief Function for handling the low touch on wrist detection timer time-out.
 *
 * @details This function will be called each time the ON-wrist detection timer
 * expires.
 *
 * @param[in] p_context - unused
 */
static void lt_on_wrist_timeout_handler(void *p_context) {
  NRF_LOG_INFO("LT ON wrist Timer expiry..");
  gLowTouchTimerUp = 1;
  //lt_on_timer_stop();
  g_lt_task_timeout = ADI_OSAL_TIMEOUT_NONE;
  adi_osal_ThreadResumeFromISR(gh_lt_task_handler);
  //adi_osal_SemPost(lt_task_evt_sem);
}

/**@brief Function for handling the low touch off wrist detection timer
 * time-out.
 *
 * @details This function will be called each time the off-wrist detction timer
 * expires
 *
 * @param[in]  p_context - unused
 */
static void lt_off_wrist_timeout_handler(void *p_context) {
  NRF_LOG_INFO("LT OFF wrist Timer expiry..");
  gLowTouchTimerUp = 1;
  //lt_off_timer_stop();
  g_lt_task_timeout = ADI_OSAL_TIMEOUT_NONE;
  adi_osal_ThreadResumeFromISR(gh_lt_task_handler);
  //adi_osal_SemPost(lt_task_evt_sem);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application
 * timers for ON-wrist detection.
 */
static void on_timer_init() {
  ret_code_t err_code;

  // Create timers
  err_code = app_timer_create(
      &m_lt_on_timer_id, APP_TIMER_MODE_SINGLE_SHOT, lt_on_wrist_timeout_handler);

  APP_ERROR_CHECK(err_code);

  NRF_LOG_INFO("LT ON wrist Timer created");
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module. This creates and starts application
 * timers for OFF-wrist detection.
 */
static void off_timer_init() {
  ret_code_t err_code;

  // Create timers
  err_code = app_timer_create(&m_lt_off_timer_id, APP_TIMER_MODE_SINGLE_SHOT,
      lt_off_wrist_timeout_handler);

  APP_ERROR_CHECK(err_code);

  NRF_LOG_INFO("LT OFF wrist Timer created");
}

/**@brief   Function for starting ON-wrist application timers.
 * @details Timers are run after the scheduler has started.
 */
static void lt_on_timer_start(void) {
  uint32_t time = lt_app_cfg.onWristTimeThreshold;

  // Start repeated timer
  ret_code_t err_code = app_timer_start(
      m_lt_on_timer_id, APP_TIMER_TICKS(time), NULL);
  APP_ERROR_CHECK(err_code);
}

/**@brief   Function for stopping ON-wrist application timers.
 */
static void lt_on_timer_stop(void) {
  // Stop the repeated timer
  ret_code_t err_code = app_timer_stop(m_lt_on_timer_id);
  APP_ERROR_CHECK(err_code);
}

/**@brief   Function for starting OOF-wrist application timers.
 * @details Timers are run after the scheduler has started.
 */
static void lt_off_timer_start(void) {
  uint32_t time = lt_app_cfg.offWristTimeThreshold;

  // Start repeated timer
  ret_code_t err_code = app_timer_start(
      m_lt_off_timer_id, APP_TIMER_TICKS(time), NULL);
  APP_ERROR_CHECK(err_code);
}

/**@brief   Function for stopping OFF-wrist application timers.
 */
static void lt_off_timer_stop(void) {
  // Stop the repeated timer
  ret_code_t err_code = app_timer_stop(m_lt_off_timer_id);
  APP_ERROR_CHECK(err_code);
}

/** @brief Low touch task init function. */
void low_touch_task_init(void) {
  ADI_OSAL_STATUS eOsStatus;

  /* Create LT app thread */
  g_lt_task_attributes.pThreadFunc = lt_task;
  g_lt_task_attributes.nPriority = APP_OS_CFG_LT_APP_TASK_PRIO;
  g_lt_task_attributes.pStackBase = &ga_lt_task_stack[0];
  g_lt_task_attributes.nStackSize = APP_OS_CFG_LT_APP_TASK_STK_SIZE;
  g_lt_task_attributes.pTaskAttrParam = NULL;
  g_lt_task_attributes.szThreadName = "low_touch";
  g_lt_task_attributes.pThreadTcb = &g_lt_task_tcb;

  eOsStatus = adi_osal_MsgQueueCreate(&gh_lt_task_msg_queue, NULL, 9);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  } else {
    update_task_queue_list(APP_OS_CFG_LT_TASK_INDEX, gh_lt_task_msg_queue);
  }

  eOsStatus =
      adi_osal_ThreadCreateStatic(&gh_lt_task_handler, &g_lt_task_attributes);
  if (eOsStatus != ADI_OSAL_SUCCESS) {
    Debug_Handler();
  }

  //adi_osal_SemCreate(&lt_task_evt_sem, 0);
  // touch_detect_init();

  // ON-OFF detection Timer creation
  on_timer_init();
  off_timer_init();
}

/** @brief Function to enable/disable the bottom touch channel detection in
 * AD7156
 * @param  en - 1 -> enable 0 -> disable
 * @return none
 */
void bottom_touch_func_set(uint8_t en) {
  Ad7156_detect_set(AD7156_CHANNEL2, en);
}

/** @brief Function handler which gets registered to AD7156 OUT2 gpio event
 * @param  value - gpio value which gets detected upon gpio event
 * @return none
 */
static void out2_pin_detect(uint8_t value) {
  LowTouchAd7156IntCallback(value);
  g_lt_task_timeout = ADI_OSAL_TIMEOUT_NONE;
  adi_osal_ThreadResumeFromISR(gh_lt_task_handler);
  //adi_osal_SemPost(lt_task_evt_sem);
}

/** @brief LT task function
 * @param  arg - unused
 * @return none
 */
static void lt_task(void *arg) {
  m2m2_hdr_t *p_in_pkt = NULL;
  m2m2_hdr_t *p_out_pkt = NULL;
  ADI_OSAL_STATUS err;
  UNUSED_PARAMETER(arg);

  touch_detect_init();

  /* Wait for FS task FindConfigFile() completes */
  adi_osal_ThreadSuspend(NULL);
  /* Wait for FS task FindConfigFile() completes */
  //adi_osal_SemPend(lt_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);

  /* Check & Load from DCB LT lcfg if lcfg is available in wrist_detect_dcb
     so that lcfg parameters when read from the Tool, gives values correctly
  */
  if (wrist_detect_get_dcb_present_flag()) {
    lt_app_lcfg_set_from_dcb();
  }
  else
    lt_app_lcfg_set_fw_default();

  // On Bootup Enable LT app if LT cfg files are present
  if (gen_blk_get_dcb_present_flag() || gsCfgFileFoundFlag)
    EnableLowTouchDetection(true);

// Test DCB/NAND cfg working without ON/OFF Wrist events
#ifdef TEST_LT_APP_WITHOUT_EVENTS
  static volatile uint8_t gb_trig_event = 0;

  while (1) {
    // adi_osal_SemPend(lt_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);
    // p_in_pkt = post_office_get(ADI_OSAL_TIMEOUT_NONE,
    // APP_OS_CFG_LT_TASK_INDEX);
    p_in_pkt = post_office_get(5000, APP_OS_CFG_LT_TASK_INDEX);

