ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad7156_lt/low_touch_task.c
    // We got an m2m2 message from the queue, process it.
    if (p_in_pkt != NULL) {
      // We got an m2m2 message from the queue, process it.
      PYLD_CST(p_in_pkt, _m2m2_app_common_cmd_t, p_in_cmd);
      // Look up the appropriate function to call in the function table
      for (int i = 0; i < LT_APP_ROUTING_TBL_SZ; i++) {
        if (lt_app_routing_table[i].command == p_in_cmd->command) {
          p_out_pkt = lt_app_routing_table[i].cb_handler(p_in_pkt);
          break;
        }
      }
      post_office_consume_msg(p_in_pkt);
      if (p_out_pkt != NULL) {
        post_office_send(p_out_pkt, &err);
      }
    } else {
      if (eCurDetection_State == ON_WRIST && gb_trig_event) {
        OnWristEventDetecedCnt++;
        SendStartLowTouchLogReq(); /*start low touch logging*/
        NRF_LOG_INFO("send start low touch log req");
        gb_trig_event = 0;
      }
      if (eCurDetection_State == OFF_WRIST && gb_trig_event) {
        OffWristEventDetecedCnt++;
        SendStopLowTouchLogReq(); /*stop low touch logging*/
        NRF_LOG_INFO("send stop low touch log req");
        gb_trig_event = 0;
      }
    } // else
  }
#else

  while (1) {
    //adi_osal_ThreadSuspend(NULL);
    //adi_osal_SemPend(lt_task_evt_sem, ADI_OSAL_TIMEOUT_FOREVER);

    //p_in_pkt = post_office_get(ADI_OSAL_TIMEOUT_NONE, APP_OS_CFG_LT_TASK_INDEX); //LT events
    //p_in_pkt = post_office_get(ADI_OSAL_TIMEOUT_FOREVER, APP_OS_CFG_LT_TASK_INDEX); //m2m2 pkt
    p_in_pkt = post_office_get(g_lt_task_timeout, APP_OS_CFG_LT_TASK_INDEX);

    // We got an m2m2 message from the queue, process it.
    if (p_in_pkt != NULL) {
      // We got an m2m2 message from the queue, process it.
      PYLD_CST(p_in_pkt, _m2m2_app_common_cmd_t, p_in_cmd);
      // Look up the appropriate function to call in the function table
      for (int i = 0; i < LT_APP_ROUTING_TBL_SZ; i++) {
        if (lt_app_routing_table[i].command == p_in_cmd->command) {
          p_out_pkt = lt_app_routing_table[i].cb_handler(p_in_pkt);
          break;
        }
      }
      post_office_consume_msg(p_in_pkt);
      if (p_out_pkt != NULL) {
        post_office_send(p_out_pkt, &err);
      }
    } else {
      LowTouchTimerEvent();
      LowTouchSensorEvent();
    }
    adi_osal_ThreadSuspend(NULL);
  }
#endif
}

/**
 * @brief  Function to send PO pkts to LT task
 * @param  p_pkt m2m2 packet to be send to LT task
 * @return None
 */
void send_message_lt_task(m2m2_hdr_t *p_pkt) {
  ADI_OSAL_STATUS osal_result;
  osal_result = adi_osal_MsgQueuePost(gh_lt_task_msg_queue, p_pkt);
  if (osal_result != ADI_OSAL_SUCCESS)
    post_office_consume_msg(p_pkt);
  g_lt_task_timeout = ADI_OSAL_TIMEOUT_FOREVER;
  vTaskResume((TaskHandle_t)gh_lt_task_handler);
  //adi_osal_SemPost(lt_task_evt_sem);
}

/**
 * @brief  Function to set the LT app lcfg to default fw values
 * @param  None
 * @return None
 */
void lt_app_lcfg_set_fw_default()
{
    lt_app_cfg.onWristTimeThreshold  = LT_ON_WRIST_TIME_INTERVAL;
    lt_app_cfg.offWristTimeThreshold = LT_OFF_WRIST_TIME_INTERVAL;
    lt_app_cfg.airCapVal  = LT_AIR_CAP_VAL;
    lt_app_cfg.skinCapVal = LT_SKIN_CAP_VAL;
}

/**
 * @brief  Function to set the LT app lcfg to from wrist detect DCB
 * @param  None
 * @return None
 */
void lt_app_lcfg_set_from_dcb()
{
  load_wrist_detect_dcb();
  copy_lt_lcfg_from_wrist_detect_dcb(&lt_app_cfg);
}
#ifdef DCB
/**
 * @brief  Function which handles the m2m2 command to do gen_blk_DCB read
 * @param  p_pkt m2m2 REQ packet
 * @return m2m2 RESP packet
 */
static m2m2_hdr_t *gen_blk_dcb_command_read_config(m2m2_hdr_t *p_pkt) {
  uint16_t r_size;
  uint16_t i, p, num_of_pkts, dcbdata_index;;
  uint32_t dcbdata[MAXGENBLKDCBSIZE * 4];
  ADI_OSAL_STATUS err;

  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

  PKT_MALLOC(p_resp_pkt, m2m2_dcb_gen_blk_data_t, 0);
  if(NULL != p_resp_pkt)
  {
    // Declare a pointer to the response packet payload
    PYLD_CST(p_resp_pkt, m2m2_dcb_gen_blk_data_t, p_resp_payload);

    memset(dcbdata, 0, sizeof(dcbdata));
    r_size =
        (uint16_t)(MAXGENBLKDCBSIZE * 4); // Max words that can be read from FDS

    if (read_gen_blk_dcb(&dcbdata[0], &r_size) == GEN_BLK_DCB_STATUS_OK) {
      num_of_pkts = (r_size/MAXGENBLKDCBSIZE) +
                    ( (r_size%MAXGENBLKDCBSIZE) ? 1 : 0 );
      dcbdata_index = 0;
      for( p=0; p<num_of_pkts; p++ )
      {
      	p_resp_payload->command = M2M2_DCB_COMMAND_READ_CONFIG_RESP;
      	p_resp_payload->status = M2M2_DCB_STATUS_OK;
      	p_resp_payload->size = (p != num_of_pkts-1) ? MAXGENBLKDCBSIZE :
                                                     (r_size%MAXGENBLKDCBSIZE);
      	p_resp_payload->num_of_pkts = num_of_pkts;
      	for (i = 0; i < p_resp_payload->size; i++)
      		p_resp_payload->dcbdata[i] = dcbdata[dcbdata_index++];
      	p_resp_pkt->src = p_pkt->dest;
      	p_resp_pkt->dest = p_pkt->src;
      	NRF_LOG_INFO("%d pkt's sz->%d", (p+1), p_resp_payload->size);

      	if(p != num_of_pkts-1)
      	{
      	  post_office_send(p_resp_pkt, &err);

      	  /*Delay is required b/w two pkts send, this was increased from 20,
      	  kept initially to 60, when back to back write/read/delete DCB
      	  tests were seen to fail
      	  */
      	  MCU_HAL_Delay(60);

      	  PKT_MALLOC(p_resp_pkt, m2m2_dcb_gen_blk_data_t, 0);
      	  if(NULL != p_resp_pkt)
      	  {
      	  	// Declare a pointer to the response packet payload
      	  	PYLD_CST(p_resp_pkt, m2m2_dcb_gen_blk_data_t, p_resp_payload);

      	  }//if(NULL != p_resp_pkt)
      	  else
      	  {
      	  	return NULL;
      	  }
      	}
      }//for loop
    } else {
      p_resp_payload->size = 0;
      p_resp_payload->num_of_pkts = 0;
      status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_READ_CONFIG_RESP;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }//if(NULL != p_resp_pkt)
  return p_resp_pkt;
}

/* Reuse the dcbdata[] buffer used in adpd4000_task.c for
 * adpd_dcb_command_write_config() api */
/* Buffer to be shared task( General Blk DCB & ADPD4000 DCB */
extern uint32_t dcbdata[MAXADPD4000DCBSIZE * 4];
/**
 * @brief  Function which handles the m2m2 command to do gen_blk_DCB write
 * @param  p_pkt m2m2 REQ packet
 * @return m2m2 RESP packet
 */
static m2m2_hdr_t *gen_blk_dcb_command_write_config(m2m2_hdr_t *p_pkt) {
  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;
  // static uint32_t  dcbdata[MAXGENBLKDCBSIZE*2];
  static uint16_t i = 0;
  static uint16_t num_of_pkts = 0;
  uint16_t j;

  // Declare a pointer to access the input packet payload
  PYLD_CST(p_pkt, m2m2_dcb_gen_blk_data_t, p_in_payload);
  PKT_MALLOC(p_resp_pkt, m2m2_dcb_gen_blk_data_t, 0);
  if(NULL != p_resp_pkt)
  {
    // Declare a pointer to the response packet payload
    PYLD_CST(p_resp_pkt, m2m2_dcb_gen_blk_data_t, p_resp_payload);

