ArrowElectronics/Vital-Signs-Monitoring/adi_study_watch/nrf5_sdk_15.2.0/adi_study_watch/modules/ad7156_lt/low_touch_task.c
    // Maximum 4 packets can be written to GEN_BLK_DCB
    if (p_in_payload->num_of_pkts >= 1 && p_in_payload->num_of_pkts <= 4) {
      num_of_pkts += 1;
      for (j = 0; j < p_in_payload->size; j++)
        dcbdata[i++] = p_in_payload->dcbdata[j];
      NRF_LOG_INFO("Wr DCB:pkt sz->%d, arr index=%d", p_in_payload->size, i);
      if (num_of_pkts == p_in_payload->num_of_pkts) {
        if (write_gen_blk_dcb(&dcbdata[0], i) == GEN_BLK_DCB_STATUS_OK) {
          gen_blk_set_dcb_present_flag(true);
          NRF_LOG_INFO("LT gen blk DCB written");
          EnableLowTouchDetection(true);
          status = M2M2_DCB_STATUS_OK;
        } else {
          status = M2M2_DCB_STATUS_ERR_ARGS;
        }
        num_of_pkts = 0;
        i = 0;
      } else if (num_of_pkts < p_in_payload->num_of_pkts) {
        status = M2M2_DCB_STATUS_OK;
      } else {
          /* Unexpected, some error condition, clear the static variables kept */
          num_of_pkts = 0;
          i = 0;
          status = M2M2_DCB_STATUS_ERR_ARGS;
      }
    }
    else
    {
      /* Unexpected, some error condition, clear the static variables kept */
      num_of_pkts = 0;
      i = 0;
      status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_WRITE_CONFIG_RESP;
    p_resp_payload->size = 0;
    p_resp_payload->num_of_pkts = p_in_payload->num_of_pkts;
    for(uint16_t k=0; k<MAXGENBLKDCBSIZE; k++)
      p_resp_payload->dcbdata[k] = 0;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }//if(NULL != p_resp_pkt)
  return p_resp_pkt;
}

/**
 * @brief  Function which handles the m2m2 command to do gen_blk_DCB delete
 * @param  p_pkt m2m2 REQ packet
 * @return m2m2 RESP packet
 */
static m2m2_hdr_t *gen_blk_dcb_command_delete_config(m2m2_hdr_t *p_pkt) {
  M2M2_DCB_STATUS_ENUM_t status = M2M2_DCB_STATUS_ERR_NOT_CHKD;

  PKT_MALLOC(p_resp_pkt, m2m2_dcb_gen_blk_data_t, 0);
  if(NULL != p_resp_pkt)
  {
    // Declare a pointer to the response packet payload
    PYLD_CST(p_resp_pkt, m2m2_dcb_gen_blk_data_t, p_resp_payload);

    if (delete_gen_blk_dcb() == GEN_BLK_DCB_STATUS_OK) {
      gen_blk_set_dcb_present_flag(false);
      SetCfgCopyAvailableFlag(false); /*update the config file copy availability
                                         flag upon LT gen blk DCB deletion */
      find_low_touch_DCB();//Update gbDCBCfgFoundFlag in system task
      NRF_LOG_INFO("LT gen blk DCB deleted");
      if (!gen_blk_get_dcb_present_flag() && !gsCfgFileFoundFlag)
        EnableLowTouchDetection(false);
      status = M2M2_DCB_STATUS_OK;
    } else {
      status = M2M2_DCB_STATUS_ERR_ARGS;
    }

    p_resp_payload->status = status;
    p_resp_payload->command = M2M2_DCB_COMMAND_ERASE_CONFIG_RESP;
    p_resp_payload->size = 0;
    for(uint16_t i=0; i<MAXGENBLKDCBSIZE; i++)
      p_resp_payload->dcbdata[i] = 0;
    p_resp_pkt->src = p_pkt->dest;
    p_resp_pkt->dest = p_pkt->src;
  }//if(NULL != p_resp_pkt)
  return p_resp_pkt;
}
#endif // DCB

#endif